#pragma once
#include"Conpany.h"
class Marketing_Department : public Conpany
{
public:

	/*********************************************************
	 *********************************************************
	 * 继承了Conpany的  virtual void get_information() = 0;  *
	 * 继承了Conpany的  virtual void print_information() = 0;*
	 * 继承了Conpany的  virtual void seek_information() = 0; *
	 * 继承了Conpany的  virtual void clear_information() = 0;*
	 *********************************************************
	 *********************************************************/


	/******************************************
	 ******************************************
	 * 输入一段时间的的订单价值，储存于系统中 *
	 ******************************************
	 ******************************************/

	void get_information();		//添加信息
	void print_information();	//打印所有信息
	void seek_information();	//寻找目标信息
	void clear_information();	//清空信息


   /**********************************************************
	**********************************************************
	* 由于资源有限，市场部门完成一批订单后不能立即就开始新的 *
	* 一批订单，即要休息一段时间，此时只能跳到下一次相邻的订 *
	* 单，依据记录的销售状况，获取最大获利的利益。           *
	**********************************************************
	***********************************************************/

	void max_profit();			//计算最大的利益

	/**********************************************************
	 **********************************************************
	 * 管理人员需要查询查询指定编号区间内利润的最大值和最小值 *
	 **********************************************************
	 ***********************************************************/

	void enquary_max_min_profit();

	/**********************************************************
	 **********************************************************
	 *公司需要对商品进行配送，输入城市和路线，计算最短的距离  *
	 **********************************************************
	 ***********************************************************/

	void shortest_path();
	void addprofit();			//增加区间的值
	void book_room();			//预定会议室
	void sort_information();	//编号大小排序
	void meanue();
	void shudu_game();			//数独小游戏
};
